[Killed] StringLiteral
block_15/exercise-digimon-finders/src/App.js:8:72
 class App extends React.Component {
   constructor() {
     super();
-    this.state = { searchDigimon: '', isFetching: false, errorMessage: '' };
+    this.state = { searchDigimon: '', isFetching: false, errorMessage: "Stryker was here!" };
   }
 

[Survived] BlockStatement
block_15/exercise-digimon-finders/src/App.js:11:27
     this.state = { searchDigimon: '', isFetching: false, errorMessage: '' };
   }
 
-  inputValue = (value) => {
-    this.setState((state) => ({
-      ...state,
-      searchDigimon: value,
-    }));
-  }
+  inputValue = (value) => {}
 
   requestDigimon = async () => {

[Survived] ArrowFunction
block_15/exercise-digimon-finders/src/App.js:12:19
   }
 
   inputValue = (value) => {
-    this.setState((state) => ({
-      ...state,
-      searchDigimon: value,
-    }));
+    this.setState(() => undefined);
   }
 

[Survived] BlockStatement
block_15/exercise-digimon-finders/src/App.js:18:32
     }));
   }
 
-  requestDigimon = async () => {
-    const { searchDigimon } = this.state;
-    if (searchDigimon) {
-      fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
-        .then((res) => res.json())
-        .then((results) => this.setState((state) => ({
-          ...state,
-          digimon: results[0],
-          errorMessage: results["ErrorMsg"],
-          isFetching: true,
-        })));
-    }
-  }
+  requestDigimon = async () => {}
 
   render() {

[Survived] ConditionalExpression
block_15/exercise-digimon-finders/src/App.js:20:9
 
   requestDigimon = async () => {
     const { searchDigimon } = this.state;
-    if (searchDigimon) {
+    if (false) {
       fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
         .then((res) => res.json())

[Survived] ArrowFunction
block_15/exercise-digimon-finders/src/App.js:23:42
     if (searchDigimon) {
       fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
         .then((res) => res.json())
-        .then((results) => this.setState((state) => ({
-          ...state,
-          digimon: results[0],
-          errorMessage: results["ErrorMsg"],
-          isFetching: true,
-        })));
+        .then((results) => this.setState(() => undefined));
     }
   }

[Survived] ArrowFunction
block_15/exercise-digimon-finders/src/App.js:23:15
     if (searchDigimon) {
       fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
         .then((res) => res.json())
-        .then((results) => this.setState((state) => ({
-          ...state,
-          digimon: results[0],
-          errorMessage: results["ErrorMsg"],
-          isFetching: true,
-        })));
+        .then(() => undefined);
     }
   }

[Survived] StringLiteral
block_15/exercise-digimon-finders/src/App.js:26:33
         .then((results) => this.setState((state) => ({
           ...state,
           digimon: results[0],
-          errorMessage: results["ErrorMsg"],
+          errorMessage: results[""],
           isFetching: true,
         })));

[Survived] BooleanLiteral
block_15/exercise-digimon-finders/src/App.js:27:23
           ...state,
           digimon: results[0],
           errorMessage: results["ErrorMsg"],
-          isFetching: true,
+          isFetching: false,
         })));
     }

[Killed] BlockStatement
block_15/exercise-digimon-finders/src/App.js:32:12
     }
   }
 
-  render() {
-    const { digimon, searchDigimon, isFetching, errorMessage } = this.state;
-    return (
-      <div className="App">
-        <input
-          value={searchDigimon}
-          type="text"
-          onChange={({ target }) => this.inputValue(target.value)}
-          data-testid="input"
-        />
-        <button
-          data-testid="buttonSearch"
-          onClick={this.requestDigimon}
-          type="button"
-        >
-          Search Digimon
-        </button>
-        { isFetching && !errorMessage
-          ? <Digimon digimon={digimon} />
-          : <h1>{errorMessage || 'Faça uma pesquisa'}</h1>
-        }
-      </div>
-    );
-  }
+  render() {}
 }
 

[Survived] ArrowFunction
block_15/exercise-digimon-finders/src/App.js:39:21
         <input
           value={searchDigimon}
           type="text"
-          onChange={({ target }) => this.inputValue(target.value)}
+          onChange={() => undefined}
           data-testid="input"
         />

[Killed] ConditionalExpression
block_15/exercise-digimon-finders/src/App.js:49:11
         >
           Search Digimon
         </button>
-        { isFetching && !errorMessage
+        { true
           ? <Digimon digimon={digimon} />
           : <h1>{errorMessage || 'Faça uma pesquisa'}</h1>

[Killed] LogicalOperator
block_15/exercise-digimon-finders/src/App.js:49:11
         >
           Search Digimon
         </button>
-        { isFetching && !errorMessage
+        { isFetching || !errorMessage
           ? <Digimon digimon={digimon} />
           : <h1>{errorMessage || 'Faça uma pesquisa'}</h1>

[Killed] ConditionalExpression
block_15/exercise-digimon-finders/src/App.js:51:18
         </button>
         { isFetching && !errorMessage
           ? <Digimon digimon={digimon} />
-          : <h1>{errorMessage || 'Faça uma pesquisa'}</h1>
+          : <h1>{false}</h1>
         }
       </div>
